'------------------------------------------------------------------------------------------------------------
' Module        : DB_ETM_API - Реализация доступа к данным магазина ЭТМ через их API
' Author        : gtfox
' Date          : 2023.02.12
' Description   : Доступ к системе iPro ETM через API предоставляется клиентам, зарегистрированным как юрлица
'               : Для доступа требуется авторизация, после которой выдается ключ, который живёт 2 часа
' Link          : https://visio.getbb.ru/viewtopic.php?f=44&t=1491, https://github.com/gtfox/SAPR_ASU, https://yadi.sk/d/24V8ngEM_8KXyg
'------------------------------------------------------------------------------------------------------------